GermanPersonnel/Example_Profile_Import.XML

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:ns1="http://www.hr-xml.org/3" xmlns:ns2="test9.germanpersonnel.de/soap/auth">
<env:Header>
  <ns2:Authentication>
  	<SharedSecret>VenuwKmy</SharedSecret>
  </ns2:Authentication>
</env:Header>
<env:Body>
  <ShowCandidate xmlns:oa="http://www.openapplications.org/oagis/9" releaseID="3.2" systemEnvironmentCode="production"
               xmlns="http://www.hr-xml.org/3">
  <oa:ApplicationArea>
        <oa:CreationDateTime>2013-10-22T09:28:02+02:00</oa:CreationDateTime>
        <oa:BODID>asodfij1235</oa:BODID>
    </oa:ApplicationArea>
    <DataArea>
        <oa:Show xmlns:oa="http://www.openapplications.org/oagis/9"/>
        <Candidate xmlns="http://www.hr-xml.org/3" xmlns:oa="http://www.openapplications.org/oagis/9"
                   xmlns:persy="http://www.germanpersonnel.de/persy/1">
          <DocumentID>persy-9245</DocumentID>
            <CandidateSupplier>
            	<PersonContact>
                	<PersonID>
                    	9245
                    </PersonID>
                </PersonContact>
            </CandidateSupplier>
            <CandidatePerson>
                <PersonName>
                    <FormattedName>Frau Title Formated Name</FormattedName>
                    <oa:GivenName>GivenName</oa:GivenName>
                    <FamilyName>FamilyName</FamilyName>
                    <FormerFamilyName>Mathe</FormerFamilyName>
                    <PreferredSalutationCode>Frau</PreferredSalutationCode>
                    <TitleAffixCode>Testtitel</TitleAffixCode>
                </PersonName>
                <Communication>
                    <Address type="Residence">
                        <oa:AddressLine sequence="1">martinerstr, 24</oa:AddressLine>
                        <oa:CityName>München</oa:CityName>
                        <CountryCode>DE</CountryCode>
                        <oa:PostalCode>81247</oa:PostalCode>
                    </Address>
                </Communication>
                <Communication>
                    <ChannelCode>Email</ChannelCode>
                    <UseCode>Personal</UseCode>
                    <oa:Text>test@germanpersonnel.de</oa:Text>
                </Communication>
                <CitizenshipCountryCode>DE</CitizenshipCountryCode>
                <BirthDate>1992-06-06</BirthDate>
                <GenderCode>Female</GenderCode>
                <UserArea>
                    <persy:Confidential>false</persy:Confidential>
                </UserArea>
            </CandidatePerson>
            <CandidateProfile>
                <ID>923208</ID>
                <ProfileName>Frau Testtitel Laura Brandel</ProfileName>
                <PersonAvailability>
                    <AvailabilityDates>
                        <StartDateTime>2013-06-20</StartDateTime>
                    </AvailabilityDates>
                </PersonAvailability>
                <AssociatedPositionOpening>
                    <PositionOpeningID>73970418</PositionOpeningID>
                    <PositionTitle>Teststelle 4.10.0 live</PositionTitle>
                </AssociatedPositionOpening>
                <CandidatePositionPreferences>
                    <PreferredLocation>
                        <MaximumCommuteDistanceMeasure unitCode="km">50</MaximumCommuteDistanceMeasure>
                        <ReferenceLocation>
                            <oa:CityName>München</oa:CityName>
                            <CountryCode>DE</CountryCode>
                            <oa:PostalCode>81247</oa:PostalCode>
                        </ReferenceLocation>
                    </PreferredLocation>
                    <JobCategory>
                        <JobCategoryCode>1</JobCategoryCode>
                        <oa:Description>Fachinformatiker</oa:Description>
                    </JobCategory>
                    <UserArea>
                        <persy:ApplicationDate>2013-06-20</persy:ApplicationDate>
                    </UserArea>
                </CandidatePositionPreferences>
            </CandidateProfile>
            <UserArea>
                <persy:ProfileStatus>Applicant</persy:ProfileStatus>
            </UserArea>
        </Candidate>
    </DataArea>
  </ShowCandidate></env:Body></env:Envelope>
